In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv(r"C:\Jupyter_notebook\PandasNumPyCourse\data\Titanic-train.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
df['Age'].mean().round(2)
# средний возраст пассажиров Титаника составляет 29.70 лет

np.float64(29.7)

In [4]:
df.shape

(891, 12)

In [5]:
df['Survived'].value_counts() # количество выживших и погибших пассажиров

Survived
0    549
1    342
Name: count, dtype: int64

In [6]:
df['Pclass'].value_counts() # количество пассажиров в каждом классе

Pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [7]:
df['Pclass'].sum() # сумма всех классов пассажиров

np.int64(2057)

In [8]:
df.isnull().sum() # количество пропущенных значений в каждом столбце

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [9]:
df['Age'].isnull().sum() # количество пропущенных значений в столбце 'Age'

np.int64(177)

In [10]:
df['Age'].notnull().sum() # количество заполненных значений в столбце 'Age'

np.int64(714)

In [11]:
df[df['Age'].isnull()].head() 
# первые пять строк с пропущенными значениями в столбце 'Age'

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q

In [12]:
df[['Age']].info() # информация о столбце 'Age'

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     714 non-null    float64
dtypes: float64(1)
memory usage: 7.1 KB

In [13]:
df['Age_filled'] = df['Age'].fillna(0) 
# создание нового столбца 'Age_filled', где пропущенные значения заменены на 0

In [14]:
df['Age'] = df['Age'].fillna(df['Age'].median())
# заполнение пропущенных значений в столбце 'Age' медианным значением возраста 
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_filled
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,22.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,38.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,26.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,35.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,35.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,27.0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,19.0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,28.0,1,2,W./C. 6607,23.4500,NaN,S,0.0
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,26.0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,32.0

In [15]:
most_freq = df['Embarked'].mode()[0]
df['Embarked'] = df['Embarked'].fillna(most_freq) 
# заполнение пропущенных значений в столбце 'Embarked' наиболее частым значением
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_filled
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,22.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,38.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,26.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,35.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,35.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,27.0
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,19.0
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,28.0,1,2,W./C. 6607,23.4500,NaN,S,0.0
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,26.0
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,32.0

In [16]:
df['Embarked'].value_counts() # количество пассажиров в каждом порту посадки

Embarked
S    646
C    168
Q     77
Name: count, dtype: int64

In [17]:
df.groupby('Pclass')['Fare'].mean().round(2)
# средний тариф пассажиров в каждом классе

Pclass
1    84.15
2    20.66
3    13.68
Name: Fare, dtype: float64

In [18]:
df.groupby('Sex')['Age'].mean().round(2)
# средний пол пассажиров в каждом классе

Sex
female    27.93
male      30.14
Name: Age, dtype: float64

In [19]:
df.groupby(['Sex', 'Pclass'])['Age'].mean().round(2)
# средний возраст пассажиров в зависимости от пола и класса

Sex     Pclass
female  1         33.98
        2         28.70
        3         23.57
male    1         39.00
        2         30.51
        3         26.91
Name: Age, dtype: float64

In [20]:
df.groupby('Pclass')['Fare'].agg(['min', 'max', 'mean', 'median']).round(2) 
# минимальный, максимальный, средний и медианный тариф пассажиров в каждом классе

        min     max   mean  median
Pclass
1       0.0  512.33  84.15   60.29
2       0.0   73.50  20.66   14.25
3       0.0   69.55  13.68    8.05

In [22]:
df.groupby('Pclass')['Sex'].value_counts() 
# количество пассажиров каждого пола в каждом классе

Pclass  Sex
1       male      122
        female     94
2       male      108
        female     76
3       male      347
        female    144
Name: count, dtype: int64